GT2/SRS/DES_KO_HRN_g2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 750;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 750;
    }
    top
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    slipsurface
    {
        type            slip;
    }
    bottom
    {
        type            omegaWallFunction;
        value           uniform 4000000;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}

// ************************************************************************* //
